In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\jasmeet singh'

In [3]:
import pandas as pd

In [6]:
data4 = pd.read_excel(r'mydata1.xlsx')

In [7]:
data4

     Name   age   salary
0  jasmeet    35   20000
1   yukti     33   23000
2    vaau     18   30000